[
  {
    "title": "XRP in limbo as SEC meeting and global trade tensions rattle investor confidence",
    "published_at": "2025-04-07T01:42:55Z"
  },
  {
    "title": "Whale Address Sells Over 14,000 ETH Amid Market Concerns",
    "published_at": "2025-04-07T01:23:32Z"
  },
  {
    "title": "Crypto Market Sentiment Plummets to Extreme Fear Levels",
    "published_at": "2025-04-07T01:13:41Z"
  },
  {
    "title": "Federal Agencies to Report Cryptocurrency Holdings to Treasury Secretary",
    "published_at": "2025-04-07T01:03:54Z"
  },
  {
    "title": "U.S. Economic Recession Probability Rises to 68% in 2025",
    "published_at": "2025-04-07T00:53:53Z"
  },
  {
    "title": "White House official confirms Bitcoin, crypto holding reports are due tomorrow",
    "published_at": "2025-04-07T00:45:22Z"
  },
  {
    "title": "GENIUS vs. STABLE: How the US Stablecoin Bills Before Congress Stack Up",
    "published_at": "2025-04-07T00:24:14Z"
  },
  {
    "title": "Conor McGregor’s token creators to refund bidders after failed launch",
    "published_at": "2025-04-07T00:04:51Z"
  },
  {
    "title": "Bitcoin Price Falls as US Futures Point to Further Pain Ahead",
    "published_at": "2025-04-07T00:03:08Z"
  },
  {
    "title": "VanEck Analyst Says Retaliatory Steps From China and EU Could Boost Narrative for Crypto – Here’s Why",
    "published_at": "2025-04-07T00:00:23Z"
  },
  {
    "title": "ZachXBT slams Coinbase over account locks, data leak, and lack of transparency",
    "published_at": "2025-04-06T23:19:17Z"
  },
  {
    "title": "Markets face volatile week ahead as Bitcoin, Ether, XRP, S&P 500, and the Dow Jones crash abruptly",
    "published_at": "2025-04-06T23:13:52Z"
  },
  {
    "title": "El Salvador Continues Bitcoin Accumulation Amid Market Dips, Buys More Bitcoin for Reserves",
    "published_at": "2025-04-06T23:00:40Z"
  },
  {
    "title": "Ethereum faces 46% yearly loss – A steeper decline is possible IF…",
    "published_at": "2025-04-06T23:00:20Z"
  },
  {
    "title": "Jameson Lopp sounds alarm on Bitcoin address poisoning attacks",
    "published_at": "2025-04-06T22:09:41Z"
  },
  {
    "title": "Peter Schiff has blunt message for Saylor as Bitcoin crashes below $80K",
    "published_at": "2025-04-06T21:44:27Z"
  },
  {
    "title": "AI and Social Dapps Lead Growth as Crypto Market Cools Post-Trump Election",
    "published_at": "2025-04-06T21:43:59Z"
  },
  {
    "title": "SEC Holds Crypto Regulation Roundtable for Tailored Policies",
    "published_at": "2025-04-06T21:40:16Z"
  },
  {
    "title": "Hackers Hammer Android and iPhone Users As Bank Account Attacks Surge 258% in One Year: Kaspersky",
    "published_at": "2025-04-06T21:17:23Z"
  },
  {
    "title": "U.S. Expands Tariff Scope to Include Elephant Island, Impacting Crypto Markets",
    "published_at": "2025-04-06T21:09:51Z"
  },
  {
    "title": "ETH/BTC Ratio Hits Lowest Level Since March 2020 at 0.02113, Now 49 ETH for 1 Bitcoin",
    "published_at": "2025-04-06T20:30:40Z"
  },
  {
    "title": "Conor McGregor-backed crypto token fails to launch, raising just 39% of $1 million presale minimum",
    "published_at": "2025-04-06T20:02:35Z"
  },
  {
    "title": "Crypto Industry Leaders Urging Congress To Allow Stablecoin Issuers To Share Interest With Users: Report",
    "published_at": "2025-04-06T20:00:50Z"
  }
]